export const morningDua = {
  morning: [
    { title: "എന്നും രാവിലെ ചൊല്ലേണ്ട ദിക്‌റുകളും ദുആകളും" },
    {
      id: "1/18",
      value: "1",
      desc: "നബി (ﷺ) അരുളി : “അല്ലാഹുവിന് ദിക്റ് ചൊല്ലിക്കൊണ്ട് (എല്ലാ ദിവസവും) രാവിലെ സുബ്ഹി നമസ്കാര ശേഷം സൂര്യന്‍ ഉദിച്ചു പൊങ്ങുന്നതുവരെ ദിക്റ് ചൊല്ലി ഇരിക്കുവാനാണ് എനിക്ക് ഇസ്മാഈല്‍ സന്തതികളിലെ നാല് അടിമകളെ മോചിപ്പിക്കുന്നതിലും അധികം ഇഷ്ടമുള്ളത്. (പ്രതിഫലമുള്ളത്); അതുപോലെ, അല്ലാഹുവിന് ദിക്റ് ചൊല്ലിക്കൊണ്ട് (എല്ലാ ദിവസവും) വൈകുന്നേരത്തെ അസ്വര്‍ നമസ്കാര ശേഷം സൂര്യന്‍ അസ്തമിക്കുന്നതുവരെ ഇരിക്കുന്നവരെ പോലെ ദിക്റ് ചൊല്ലി ഇരിക്കുവാനാണ് എനിക്ക് (മറ്റു) നാല് അടിമകളെ മോചിപ്പിക്കുന്നതിലും അധികം ഇഷ്ടമുള്ളത് (പ്രതിഫലമുള്ളത്).",
      time: {
        time: "ചൊല്ലേണ്ട സമയം :",
        starting:
          "രാവിലെ : സുബ്ഹി നമസ്കാരശേഷം സൂര്യന്‍ ഉദിച്ചുപൊങ്ങുന്നതുവരെയാണ്.",
        ending:
          "വൈകുന്നേരം : അസ്വര്‍ നമസ്കാരശേഷം സൂര്യന്‍ അസ്തമിക്കുന്നതുവരേയുമാണ്.",
      },
      prayer: {
        beginning: {
          time: "",
          arabic:
            "الْحَمْدُ للِهَ وَحْدَهُ، وَالصَّلاَةُ وَالسَّلاَمُ عَلَى مَنْ لاَ نَبِيَّ بَعْدَهُ",
          malayalam:
            "“എല്ലാ സ്തുതിയും നന്ദിയും അല്ലാഹുവിന് മാത്രമാണ്. ശേഷം വേറൊരു നബി വരാനില്ലാത്ത നബി (മുഹമ്മദ്‌ സ) യുടെ മേല്‍ അല്ലാഹുവിന്‍റെ അനുഗ്രഹവും സമാധാനവുമുണ്ടാകട്ടെ”",
        },
        end: {
          arabic:
            "اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ (سورة البقرة:٢٥٥) (صحيح الترغيب والترهيب)",
          malayalam:
            "അല്ലാഹു അവനല്ലാതെ യഥാർഥ ആരാധ്യനില്ല. എന്നെന്നും ജീവിച്ചിരിക്കുന്നവൻ. എല്ലാം നിയന്ത്രിക്കുന്നവൻ. മയക്കമോ ഉറക്കമോ അവനെ ബാധിക്കുകയില്ല. ആകാശ ഭൂമികളിലുള്ളതെല്ലാം അവന്റെതാണ്. അവന്റെ അനുവാദമില്ലാതെ അവന്റെ അടുക്കൽ ശുപാർശ നടത്താനാരുണ്ട്? അവരുടെ മുന്നിലുള്ളതും പിന്നിലുള്ളതും അവൻ അറിയുന്നു. അവന്റെ അറിവിൽനിന്നും അവൻ ഉദ്ദേശിക്കുന്നതല്ലാതെ അവർക്ക് സൂക്ഷ്മമായി അറിയാൻ കഴിയില്ല. അവന്റെ കുർസിയ്യ് ആകാശഭൂമികളെ മുഴുവൻ ഉൾക്കൊള്ളുന്നതാകുന്നു. അവയുടെ സംരക്ഷണം അവന് ഒട്ടും ഭാരമുള്ളതല്ല. അവൻ ഉന്നതനും മഹാനുമതെ.",
        },
      },
      narrator:
        "ഉബയ്യ്ബിന്‍ കഅബ് (റ) നിവേദനം : നബി (ﷺ) അരുളി: “ആരെങ്കിലും വൈകുന്നേരമാകുമ്പോള്‍ ആയത്തുല്‍-കുര്‍സി ഓതിയാല്‍ പിറ്റേന്ന് രാവിലെ വരേയും ആരെങ്കിലും രാവിലെയാകുമ്പോള്‍ ആയത്തുല്‍-കുര്‍സ്സിയ്യ് ഓതിയാല്‍ അന്ന് വൈകുന്നേരം വരേയും അയാള്‍ ശൈത്താനില്‍ നിന്ന് സംരക്ഷണം ലഭിച്ചവനായി.”",
    },
    {
      id: "2/18",
      value: "2",
      desc: "",
      prayer: {
        end: {
          time: "രാവിലെ ‘3’ തവണ",
          arabic: ` بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ <br/> قُلْ هُوَ اللَّـهُ أَحَدٌ ﴿١﴾ اللَّـهُ الصَّمَدُ ﴿٢﴾ لَمْ يَلِدْ وَلَمْ يُولَدْ ﴿٣﴾ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ ﴿٤﴾ <br/> (سورة الإخلاص:١-٤) <br/>بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ <br/> قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ﴿١﴾ مِن شَرِّ مَا خَلَقَ ﴿٢﴾ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿٣﴾ وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ﴿٤﴾ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿٥﴾ <br/> (سورة الفلق:١-٥)<br/> بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ <br/> قُلْ أَعُوذُ بِرَبِّ النَّاسِ ﴿١﴾ مَلِكِ النَّاسِ ﴿٢﴾ إِلَـٰهِ النَّاسِ ﴿٣﴾ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ﴿٤﴾ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ﴿٥﴾ مِنَ الْجِنَّةِ وَالنَّاسِ ﴿٦﴾ <br/> (سورة الناس:١-٦) <br/>( حسنة الألباني في سنن أبي داود ، الترمذي)  `,
          malayalam: `1) അല്‍'ഇഖ്‌ലാസ് - (നബിയേ,) പറയുക: കാര്യം അല്ലാഹു ഏകനാണ് എന്നതാകുന്നു. അല്ലാഹു ഏവര്‍ക്കും ആശ്രയമായിട്ടുള്ളവനാകുന്നു.അവന്‍ (ആര്‍ക്കും) ജന്‍മം നല്‍കിയിട്ടില്ല. (ആരുടെയും സന്തതിയായി) ജനിച്ചിട്ടുമില്ല. അവന്ന് തുല്യനായി ആരും ഇല്ലതാനും. <br/> 2) അല്‍'ഫലഖ് - പറയുക. പുലരിയുടെ റബ്ബിനോട്‌ ഞാന്‍ രക്ഷതേടുന്നു. അവന്‍ സൃഷ്ടിച്ചിട്ടുള്ളവയുടെ തിന്മയില്‍ നിന്നും, ഇരുളടയുമ്പോഴുള്ള രാത്രിയുടെ തിന്മയില്‍ നിന്നും, കെട്ടുകളില്‍ ഊതുന്ന സ്ത്രീകളുടെ തിന്മയില്‍ നിന്നും,അസൂയാലു അസൂയപ്പെടുമ്പോള്‍ അതിന്‍റെ തിന്മയില്‍ നിന്നും. <br/> 3) അന്നാസ്‌ - പറയുക: മനുഷ്യരുടെ രക്ഷിതാവിനോട് ഞാന്‍ ശരണം തേടുന്നു. (1) മനുഷ്യരുടെ രാജാവിനോട്‌. (2) മനുഷ്യരുടെ (ആരാധനക്കര്‍ഹനായ ഏക)ദൈവത്തോട്‌. (3) ദുര്‍ബോധനം നടത്തി പിന്‍മാറിക്കളയുന്നവരെക്കൊണ്ടുള്ള കെടുതിയില്‍ നിന്ന്‌. (4) മനുഷ്യരുടെ ഹൃദയങ്ങളില്‍ ദുര്‍ബോധനം നടത്തുന്നവര്‍. (5) മനുഷ്യരിലും ജിന്നുകളിലും പെട്ടവര്‍. (6)നബി (ﷺ) അരുളി : “എല്ലാ ദിവസവും രാവിലെയും വൈകുന്നേരവും നീ ഖുല്‍ ഹുവല്ലാഹു അഹദ്…, ‘ഖുല്‍ അഊദു ബിറബ്ബില്‍ ഫലഖ്…, ‘ഖുല്‍ അഊദു ബിറബ്ബിന്നാസ്’… സൂറത്തുകള്‍ പാരായണം ചെയ്‌താല്‍ നിനക്ക് (രോഗം, സിഹ്റ്, കണ്ണേറ്, വിഷാദരോഗം…) എല്ലാറ്റിനും അവ മതിയാകുന്നതാകുന്നു!”`,
        },
      },
      narrator:
        "നബി (ﷺ) അരുളി : “എല്ലാ ദിവസവും രാവിലെയും വൈകുന്നേരവും നീ ഖുല്‍ ഹുവല്ലാഹു അഹദ്…, ‘ഖുല്‍ അഊദു ബിറബ്ബില്‍ ഫലഖ്…, ‘ഖുല്‍ അഊദു ബിറബ്ബിന്നാസ്’… സൂറത്തുകള്‍ പാരായണം ചെയ്‌താല്‍ നിനക്ക് (രോഗം, സിഹ്റ്, കണ്ണേറ്, വിഷാദരോഗം…) എല്ലാറ്റിനും അവ മതിയാകുന്നതാകുന്നു!”",
    },
    {
      id: "3/18",
      value: "3",
      desc: "",
      prayer: {
        end: {
          time: "രാവിലെ '1' തവണ",
          arabic:
            " أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلهِّ . وَالْحَمْدُ لِلهِّ، لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذاَ الْيَوْمَ وَخَيْرَ مَا بَعْدَهُ وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ، وَسُوِء الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وعَذَابٍ فِي الْقَبْرِ <br/> (مسلم, وصححه الألباني في سنن أبي داود)",
          malayalam:
            "ഈ പ്രഭാതത്തിൽ മുഴുവൻ ആധിപത്യവും അല്ലാഹുവിന് മാത്രമായിരിക്കെ ഞങ്ങൾ പ്രഭാതത്തിൽ പ്രവേശിച്ചിരിക്കുന്നു. സർവസ്തുതിയും അല്ലാഹുവിന് മാത്രമാകുന്നു. യഥാർഥ ആരാധ്യനായി അല്ലാഹുവല്ലാതെ മറ്റാരുമില്ല. അവൻ ഏകനാകുന്നു. അവന് യാതൊരു പങ്കുകാരുമില്ല. രാജാധിപത്യം അവനുമാത്രമാണ്. എല്ലാ സ്തുതികളും അവനു മാത്രമാണ്. അവൻ എല്ലാത്തിനും കഴിവുള്ളവനുമാണ്. എന്റെ രക്ഷിതാവേ, ഈ ദിനത്തിലെ നന്മയും ശേഷമുള്ള ദിനങ്ങളിലെ നന്മയും ഞാൻ തേടുന്നു. ഈ ദിനത്തിലെ തിന്മയിൽ നിന്നും ശേഷമുള്ള ദിനങ്ങളിലെ തിന്മയിൽ നിന്നും ഞാൻ നിന്നോട് രക്ഷ ചോദിക്കുന്നു. അല്ലാഹുവേ അലസതയിൽ നിന്നും വാർധ്യക്യത്തിലെ ദുരിതത്തിൽനിന്നും നിന്നോട് ഞാൻ രക്ഷ തേടുന്നു. എൻറെ റബ്ബേ നരകത്തിലെയും ഖബറിലേയും ശിക്ഷയിൽ നിന്നും നിന്നോട് രക്ഷ തേടുന്നു",
        },
      },
    },
    {
      id: "4/18",
      value: "4",
      desc: "",
      prayer: {
        end: {
          time: "",
          arabic: "",
          malayalam: "",
        },
      },
    },
    {
      id: "5/18",
      value: "5",
      desc: "",
      prayer: {
        end: {
          time: "",
          arabic: "",
          malayalam: "",
        },
      },
    },
    {
      id: "6/18",
      value: "6",
      desc: "",
      prayer: {
        end: {
          time: "",
          arabic: "",
          malayalam: "",
        },
      },
    },
    {
      id: "7/18",
      value: "7",
      desc: "",
      prayer: {
        end: {
          time: "",
          arabic: "",
          malayalam: "",
        },
      },
    },
    {
      id: "8/18",
      value: "8",
      desc: "",
      prayer: {
        end: {
          time: "",
          arabic: "",
          malayalam: "",
        },
      },
    },
    {
      id: "9/18",
      value: "9",
      desc: "",
      prayer: {
        end: {
          time: "",
          arabic: "",
          malayalam: "",
        },
      },
    },
  ],
};
export const evening = [
  {
    id: "1/12",
    value: "1",
    desc: "ssddsds",
    prayer: {
      end: {
        time: "",
        arabic: "sdsd",
        malayalam: "sds",
      },
    },
  },
];
export const afterSleeping = [
  {
    id: "1/5",
    value: "1",
    desc: "ssddsdsassdsa",
    prayer: {
      end: {
        time: "",
        arabic: "sdsdasdsd",
        malayalam: "sdsasdas",
      },
    },
  },
  {
    id: "2/5",
    value: "2",
    desc: "dfg11111asdas1",
    prayer: {
      end: {
        time: "",
        arabic: "fgfasdasg",
        malayalam: "fgfasdas",
      },
    },
  },
];
